app/controllers/todos_controller.rb

  def index
    # this is for React.js to render server-side
    @presenter = {
      :todos => Todo.where("active = true").order("position"),
      :form => {
---
SELECT "todos".* FROM "todos" WHERE (active = true)  ORDER BY position

  def create
    @todo = Todo.new(todo_params)
    @todos = Todo.all

    @todo.position = @todos.count+1

    if @todo.valid?
      @todo.save
---
SELECT COUNT(*) FROM "todos"
INSERT INTO "todos" ("done", "position", "todo", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["done", "t"], ["position", 1], ["todo", "this is a new todo"], ["active", "t"], ["created_at", "2015-11-07 05:26:42.393107"], ["updated_at", "2015-11-07 05:26:42.393107"]]

  def update
    @todo = Todo.find(params[:id])

    if @todo.update_attributes(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 24]]
UPDATE "todos" SET "position" = $1, "todo" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["position", 3], ["todo", "This is updated"], ["updated_at", "2015-11-07 06:03:09.204775"], ["id", 223]]

  def sort
    params[:sort_list].each_with_index do |id, index|
      Todo.find(id).update_attribute('position', index+1)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 37]]
UPDATE "todos" SET "position" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["position", 1], ["updated_at", "2015-11-07 10:08:12.217568"], ["id", 37]]