app/controllers/todos_controller.rb

  def index
    # this is for React.js to render server-side
    @presenter = {
      :todos => Todo.all,
      :form => {
---
SELECT "todos".* FROM "todos"